ccc007ccc/DS5Dongle/main/esp32_dual_chip_response_scheduler.c
#include "esp32_dual_chip_response_scheduler.h"

#include "dual_chip_spi_proto.h"
#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"

#include <string.h>

#define RESPONSE_CONTROL_CAPACITY 8U
#define RESPONSE_FEATURE_CAPACITY 8U
#define RESPONSE_INPUT_CAPACITY 4U
#define RESPONSE_MIC_CAPACITY 4U
#define RESPONSE_CONTROL_MAX 160U
#define RESPONSE_FEATURE_MAX 160U
#define RESPONSE_INPUT_MAX 80U
#define RESPONSE_MIC_MAX 71U
#define RESPONSE_LINK_MAX 56U
#define RESPONSE_STATUS_MAX 64U
#define RESPONSE_TELEMETRY_MAX 512U

typedef enum {
    RESPONSE_STORE_NONE = 0,
    RESPONSE_STORE_CONTROL,
    RESPONSE_STORE_FEATURE,
    RESPONSE_STORE_INPUT,
    RESPONSE_STORE_MIC,
    RESPONSE_STORE_LINK,
    RESPONSE_STORE_STATUS,
    RESPONSE_STORE_TELEMETRY,
} response_store_class_t;

typedef struct {
    ds5_sched_meta_t meta;
    uint32_t version;
    uint16_t wire_flags;
    uint16_t wire_sequence;
    uint8_t state;
    uint8_t type;
    uint8_t channel;
    uint8_t priority;
} response_header_t;

#define DEFINE_RESPONSE_SLOT(name, payload_size) \
    typedef struct {                               \
        response_header_t header;                  \
        uint8_t payload[payload_size];              \
    } name

DEFINE_RESPONSE_SLOT(response_control_slot_t, RESPONSE_CONTROL_MAX);
DEFINE_RESPONSE_SLOT(response_feature_slot_t, RESPONSE_FEATURE_MAX);
DEFINE_RESPONSE_SLOT(response_input_slot_t, RESPONSE_INPUT_MAX);
DEFINE_RESPONSE_SLOT(response_mic_slot_t, RESPONSE_MIC_MAX);
DEFINE_RESPONSE_SLOT(response_link_slot_t, RESPONSE_LINK_MAX);
DEFINE_RESPONSE_SLOT(response_status_slot_t, RESPONSE_STATUS_MAX);
DEFINE_RESPONSE_SLOT(response_telemetry_slot_t, RESPONSE_TELEMETRY_MAX);

typedef struct {
    response_control_slot_t control[RESPONSE_CONTROL_CAPACITY];
    response_feature_slot_t feature[RESPONSE_FEATURE_CAPACITY];
    response_input_slot_t input[RESPONSE_INPUT_CAPACITY];
    response_mic_slot_t mic[RESPONSE_MIC_CAPACITY];
    response_link_slot_t link;
    response_status_slot_t status;
    response_telemetry_slot_t telemetry;
    ds5_sched_metrics_t metrics;
} esp32_dual_response_storage_t;

esp32_dual_response_storage_t g_ds5_response_scheduler_storage;

_Static_assert(RESPONSE_CONTROL_CAPACITY ==
                   DS5_SCHED_ESP_RELIABLE_CONTROL_CAPACITY,
               "response control capacity drift");
_Static_assert(RESPONSE_FEATURE_CAPACITY ==
                   DS5_SCHED_ESP_FEATURE_RESPONSE_CAPACITY,
               "response feature capacity drift");
_Static_assert(RESPONSE_INPUT_CAPACITY ==
                   DS5_SCHED_ESP_INPUT_RESPONSE_CAPACITY,
               "response input capacity drift");
_Static_assert(RESPONSE_MIC_CAPACITY ==
                   DS5_SCHED_ESP_MIC_RESPONSE_CAPACITY,
               "response mic capacity drift");
_Static_assert(sizeof(esp32_dual_response_storage_t) <= 7200U,
               "ESP response scheduler exceeds its typed storage budget");

static portMUX_TYPE s_response_mux = portMUX_INITIALIZER_UNLOCKED;
static esp32_dual_response_irq_cb_t s_irq_cb;
static void *s_irq_ctx;
static uint32_t s_publish_sequence;
static uint32_t s_generation;
#define RESPONSE_CONTROL_MAX_BURST 2U
#define RESPONSE_NONCONTROL_SLOTS 9U

static uint8_t s_control_burst;
static uint8_t s_noncontrol_cursor;
uint8_t g_ds5_owner_esp_response_scheduler;

static ds5_sched_class_t sched_class_for_store(response_store_class_t store)
{
    switch (store) {
    case RESPONSE_STORE_INPUT:
        return DS5_SCHED_INPUT_REALTIME;
    case RESPONSE_STORE_MIC:
        return DS5_SCHED_MIC_STREAM;
    case RESPONSE_STORE_LINK:
        return DS5_SCHED_LINK_STATE;
    case RESPONSE_STORE_TELEMETRY:
        return DS5_SCHED_TELEMETRY;
    default:
        return DS5_SCHED_RELIABLE_CONTROL;
    }
}

static ds5_sched_class_metrics_t *metrics_for_store(response_store_class_t store)
{
    ds5_sched_class_t sched_class = sched_class_for_store(store);
    return &g_ds5_response_scheduler_storage
                .metrics.classes[(uint8_t)sched_class - 1U];
}

static bool slot_pending(const response_header_t *header)
{
    return header->state == DS5_SCHED_SLOT_READY ||
           header->state == DS5_SCHED_SLOT_SENDING;
}

static uint8_t pending_count_locked(void)
{
    uint8_t count = 0;

#define COUNT_PENDING(array)                                                   \
    do {                                                                       \
        for (size_t i = 0; i < sizeof(array) / sizeof((array)[0]); i++) {      \
            count += slot_pending(&(array)[i].header) ? 1U : 0U;               \
        }                                                                      \
    } while (0)

    COUNT_PENDING(g_ds5_response_scheduler_storage.control);
    COUNT_PENDING(g_ds5_response_scheduler_storage.feature);
    COUNT_PENDING(g_ds5_response_scheduler_storage.input);
    COUNT_PENDING(g_ds5_response_scheduler_storage.mic);
#undef COUNT_PENDING
    count += slot_pending(&g_ds5_response_scheduler_storage.link.header) ? 1U : 0U;
    count += slot_pending(&g_ds5_response_scheduler_storage.status.header) ? 1U : 0U;
    count += slot_pending(&g_ds5_response_scheduler_storage.telemetry.header) ? 1U : 0U;
    return count;
}

static void sync_irq_locked(void)
{
    if (s_irq_cb != NULL) {
        s_irq_cb(pending_count_locked() != 0U, s_irq_ctx);
    }
}

static response_store_class_t classify_response(uint8_t type, uint16_t flags)
{
    if ((flags & DS5_DUAL_FLAG_ACK) != 0U ||
        type == DS5_DUAL_MSG_HELLO || type == DS5_DUAL_MSG_TIME_SYNC) {
        return RESPONSE_STORE_CONTROL;
    }
    switch (type) {
    case DS5_DUAL_MSG_BT_RX_FEATURE_REPORT:
        return RESPONSE_STORE_FEATURE;
    case DS5_DUAL_MSG_BT_RX_INPUT:
        return RESPONSE_STORE_INPUT;
    case DS5_DUAL_MSG_BT_RX_MIC_OPUS:
        return RESPONSE_STORE_MIC;
    case DS5_DUAL_MSG_BT_STATE:
        return RESPONSE_STORE_LINK;
    case DS5_DUAL_MSG_FLOW_CREDIT:
        return RESPONSE_STORE_STATUS;
    case DS5_DUAL_MSG_STATS:
        return RESPONSE_STORE_TELEMETRY;
    default:
        return RESPONSE_STORE_CONTROL;
    }
}

static void init_header(response_header_t *header,
                        response_store_class_t store,
                        uint8_t type,
                        uint16_t flags,
                        uint8_t channel,
                        uint8_t priority,
                        uint16_t wire_sequence,
                        uint32_t timestamp_us,
                        size_t payload_len)
{
    header->version++;
    header->wire_flags = flags;
    header->wire_sequence = wire_sequence;
    header->type = type;
    header->channel = channel;
    header->priority = priority;
    ds5_sched_meta_init(&header->meta,
                        timestamp_us,
                        s_generation,
                        s_publish_sequence++,
                        (uint16_t)payload_len,
                        sched_class_for_store(store),
                        0);
    header->state = DS5_SCHED_SLOT_READY;
}

static int find_free_or_oldest_ready(response_header_t *headers,
                                     size_t stride,
                                     size_t count,
                                     bool allow_replace,
                                     bool *replaced)
{
    int oldest = -1;
    uint32_t oldest_sequence = UINT32_MAX;

    *replaced = false;
    for (size_t i = 0; i < count; i++) {
        response_header_t *header =
            (response_header_t *)((uint8_t *)headers + i * stride);
        if (header->state == DS5_SCHED_SLOT_FREE) {
            return (int)i;
        }
        if (allow_replace && header->state == DS5_SCHED_SLOT_READY &&
            header->meta.sequence < oldest_sequence) {
            oldest = (int)i;
            oldest_sequence = header->meta.sequence;
        }
    }
    if (oldest >= 0) {
        *replaced = true;
    }
    return oldest;
}

static bool publish_array(response_store_class_t store,
                          response_header_t *headers,
                          size_t stride,
                          size_t count,
                          uint8_t *payloads,
                          size_t payload_offset,
                          size_t payload_capacity,
                          bool allow_replace,
                          uint8_t type,
                          uint16_t flags,
                          uint8_t channel,
                          uint8_t priority,
                          uint16_t wire_sequence,
                          uint32_t timestamp_us,
                          const uint8_t *payload,
                          size_t payload_len)
{
    bool replaced;
    int selected = find_free_or_oldest_ready(headers,
                                             stride,
                                             count,
                                             allow_replace,
                                             &replaced);
    ds5_sched_class_metrics_t *metrics = metrics_for_store(store);

    if (selected < 0 || payload_len > payload_capacity) {
        metrics->admission_rejected++;
        return false;
    }
    response_header_t *header =
        (response_header_t *)((uint8_t *)headers + selected * stride);
    uint8_t *dst = payloads + selected * stride + payload_offset;
    if (replaced) {
        metrics->replaced++;
    } else {
        metrics->pending++;
        if (metrics->pending > metrics->highwater) {
            metrics->highwater = metrics->pending;
        }
    }
    memcpy(dst, payload, payload_len);
    init_header(header,
                store,
                type,
                flags,
                channel,
                priority,
                wire_sequence,
                timestamp_us,
                payload_len);
    metrics->accepted++;
    return true;
}

static bool publish_mailbox(response_store_class_t store,
                            response_header_t *header,
                            uint8_t *dst,
                            size_t capacity,
                            uint8_t type,
                            uint16_t flags,
                            uint8_t channel,
                            uint8_t priority,
                            uint16_t wire_sequence,
                            uint32_t timestamp_us,
                            const uint8_t *payload,
                            size_t payload_len)
{
    ds5_sched_class_metrics_t *metrics = metrics_for_store(store);

