ccc007ccc/DS5Dongle/main/esp32_dual_chip_response_scheduler.c
    if (payload_len > capacity) {
        metrics->admission_rejected++;
        return false;
    }
    if (slot_pending(header)) {
        metrics->coalesced++;
    } else {
        metrics->pending++;
        if (metrics->pending > metrics->highwater) {
            metrics->highwater = metrics->pending;
        }
    }
    memcpy(dst, payload, payload_len);
    init_header(header,
                store,
                type,
                flags,
                channel,
                priority,
                wire_sequence,
                timestamp_us,
                payload_len);
    metrics->accepted++;
    return true;
}

void esp32_dual_response_scheduler_init(esp32_dual_response_irq_cb_t irq_cb,
                                        void *irq_ctx)
{
    g_ds5_owner_esp_response_scheduler = 1U;
    portENTER_CRITICAL(&s_response_mux);
    memset(&g_ds5_response_scheduler_storage,
           0,
           sizeof(g_ds5_response_scheduler_storage));
    s_irq_cb = irq_cb;
    s_irq_ctx = irq_ctx;
    s_publish_sequence = 0;
    s_generation = 0;
    s_control_burst = 0U;
    s_noncontrol_cursor = 0U;
    sync_irq_locked();
    portEXIT_CRITICAL(&s_response_mux);
}

void esp32_dual_response_reset_generation(uint32_t generation)
{
    portENTER_CRITICAL(&s_response_mux);
    if (generation == s_generation) {
        portEXIT_CRITICAL(&s_response_mux);
        return;
    }
    for (size_t store = RESPONSE_STORE_CONTROL;
         store <= RESPONSE_STORE_TELEMETRY;
         store++) {
        ds5_sched_class_metrics_t *metrics = metrics_for_store(
            (response_store_class_t)store);
        if (metrics->pending > 0U) {
            metrics->replaced += metrics->pending;
            metrics->pending = 0;
        }
    }
    memset(g_ds5_response_scheduler_storage.control,
           0,
           sizeof(g_ds5_response_scheduler_storage.control));
    memset(g_ds5_response_scheduler_storage.feature,
           0,
           sizeof(g_ds5_response_scheduler_storage.feature));
    memset(g_ds5_response_scheduler_storage.input,
           0,
           sizeof(g_ds5_response_scheduler_storage.input));
    memset(g_ds5_response_scheduler_storage.mic,
           0,
           sizeof(g_ds5_response_scheduler_storage.mic));
    memset(&g_ds5_response_scheduler_storage.link,
           0,
           sizeof(g_ds5_response_scheduler_storage.link));
    memset(&g_ds5_response_scheduler_storage.status,
           0,
           sizeof(g_ds5_response_scheduler_storage.status));
    memset(&g_ds5_response_scheduler_storage.telemetry,
           0,
           sizeof(g_ds5_response_scheduler_storage.telemetry));
    s_generation = generation;
    s_control_burst = 0U;
    s_noncontrol_cursor = 0U;
    sync_irq_locked();
    portEXIT_CRITICAL(&s_response_mux);
}

void esp32_dual_response_reset_metrics(void)
{
    portENTER_CRITICAL(&s_response_mux);
    memset(&g_ds5_response_scheduler_storage.metrics,
           0,
           sizeof(g_ds5_response_scheduler_storage.metrics));
    for (size_t store = RESPONSE_STORE_CONTROL;
         store <= RESPONSE_STORE_TELEMETRY;
         store++) {
        ds5_sched_class_metrics_t *metrics = metrics_for_store(
            (response_store_class_t)store);
        response_store_class_t current = (response_store_class_t)store;
        uint64_t pending = 0;
        switch (current) {
        case RESPONSE_STORE_CONTROL:
            for (size_t i = 0; i < RESPONSE_CONTROL_CAPACITY; i++) {
                pending += slot_pending(
                    &g_ds5_response_scheduler_storage.control[i].header);
            }
            break;
        case RESPONSE_STORE_FEATURE:
            for (size_t i = 0; i < RESPONSE_FEATURE_CAPACITY; i++) {
                pending += slot_pending(
                    &g_ds5_response_scheduler_storage.feature[i].header);
            }
            break;
        case RESPONSE_STORE_INPUT:
            for (size_t i = 0; i < RESPONSE_INPUT_CAPACITY; i++) {
                pending += slot_pending(
                    &g_ds5_response_scheduler_storage.input[i].header);
            }
            break;
        case RESPONSE_STORE_MIC:
            for (size_t i = 0; i < RESPONSE_MIC_CAPACITY; i++) {
                pending += slot_pending(
                    &g_ds5_response_scheduler_storage.mic[i].header);
            }
            break;
        case RESPONSE_STORE_LINK:
            pending = slot_pending(
                &g_ds5_response_scheduler_storage.link.header);
            break;
        case RESPONSE_STORE_STATUS:
            pending = slot_pending(
                &g_ds5_response_scheduler_storage.status.header);
            break;
        case RESPONSE_STORE_TELEMETRY:
            pending = slot_pending(
                &g_ds5_response_scheduler_storage.telemetry.header);
            break;
        default:
            break;
        }
        metrics->pending += pending;
        metrics->highwater = metrics->pending;
    }
    portEXIT_CRITICAL(&s_response_mux);
}

bool esp32_dual_response_publish(uint8_t type,
                                 uint16_t flags,
                                 uint8_t channel,
                                 uint8_t priority,
                                 uint16_t wire_sequence,
                                 uint32_t timestamp_us,
                                 const uint8_t *payload,
                                 size_t payload_len)
{
    response_store_class_t store = classify_response(type, flags);
    bool accepted = false;

    if (payload == NULL || payload_len == 0U ||
        payload_len > DS5_DUAL_SPI_MAX_PAYLOAD) {
        return false;
    }

    portENTER_CRITICAL(&s_response_mux);
    switch (store) {
    case RESPONSE_STORE_CONTROL:
        accepted = publish_array(
            store,
            &g_ds5_response_scheduler_storage.control[0].header,
            sizeof(response_control_slot_t),
            RESPONSE_CONTROL_CAPACITY,
            (uint8_t *)g_ds5_response_scheduler_storage.control,
            offsetof(response_control_slot_t, payload),
            RESPONSE_CONTROL_MAX,
            false,
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_FEATURE:
        accepted = publish_array(
            store,
            &g_ds5_response_scheduler_storage.feature[0].header,
            sizeof(response_feature_slot_t),
            RESPONSE_FEATURE_CAPACITY,
            (uint8_t *)g_ds5_response_scheduler_storage.feature,
            offsetof(response_feature_slot_t, payload),
            RESPONSE_FEATURE_MAX,
            false,
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_INPUT:
        accepted = publish_array(
            store,
            &g_ds5_response_scheduler_storage.input[0].header,
            sizeof(response_input_slot_t),
            RESPONSE_INPUT_CAPACITY,
            (uint8_t *)g_ds5_response_scheduler_storage.input,
            offsetof(response_input_slot_t, payload),
            RESPONSE_INPUT_MAX,
            true,
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_MIC:
        accepted = publish_array(
            store,
            &g_ds5_response_scheduler_storage.mic[0].header,
            sizeof(response_mic_slot_t),
            RESPONSE_MIC_CAPACITY,
            (uint8_t *)g_ds5_response_scheduler_storage.mic,
            offsetof(response_mic_slot_t, payload),
            RESPONSE_MIC_MAX,
            true,
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_LINK:
        accepted = publish_mailbox(
            store,
            &g_ds5_response_scheduler_storage.link.header,
            g_ds5_response_scheduler_storage.link.payload,
            sizeof(g_ds5_response_scheduler_storage.link.payload),
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_STATUS:
        accepted = publish_mailbox(
            store,
            &g_ds5_response_scheduler_storage.status.header,
            g_ds5_response_scheduler_storage.status.payload,
            sizeof(g_ds5_response_scheduler_storage.status.payload),
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    case RESPONSE_STORE_TELEMETRY:
        accepted = publish_mailbox(
            store,
            &g_ds5_response_scheduler_storage.telemetry.header,
            g_ds5_response_scheduler_storage.telemetry.payload,
            sizeof(g_ds5_response_scheduler_storage.telemetry.payload),
            type, flags, channel, priority, wire_sequence, timestamp_us,
            payload, payload_len);
        break;
    default:
        break;
    }
    sync_irq_locked();
    portEXIT_CRITICAL(&s_response_mux);
    return accepted;
}

static int oldest_ready(response_header_t *headers,
                        size_t stride,
                        size_t count)
{
    int selected = -1;
    uint32_t sequence = UINT32_MAX;

