ccc007ccc/DS5Dongle/main/esp32_dual_chip_response_scheduler.c
    for (size_t i = 0; i < count; i++) {
        response_header_t *header =
            (response_header_t *)((uint8_t *)headers + i * stride);
        if (header->state == DS5_SCHED_SLOT_READY &&
            header->meta.sequence < sequence) {
            selected = (int)i;
            sequence = header->meta.sequence;
        }
    }
    return selected;
}

static bool select_array(response_store_class_t store,
                         response_header_t *headers,
                         size_t stride,
                         size_t count,
                         uint8_t *payloads,
                         size_t payload_offset,
                         response_header_t *selected_header,
                         uint8_t *selected_payload,
                         esp32_dual_response_token_t *token)
{
    int selected = oldest_ready(headers, stride, count);
    if (selected < 0) {
        return false;
    }
    response_header_t *header =
        (response_header_t *)((uint8_t *)headers + selected * stride);
    header->state = DS5_SCHED_SLOT_SENDING;
    *selected_header = *header;
    memcpy(selected_payload,
           payloads + selected * stride + payload_offset,
           header->meta.length);
    token->storage_class = (uint8_t)store;
    token->slot = (uint8_t)selected;
    token->version = header->version;
    return true;
}

static bool select_mailbox(response_store_class_t store,
                           response_header_t *header,
                           const uint8_t *payload,
                           response_header_t *selected_header,
                           uint8_t *selected_payload,
                           esp32_dual_response_token_t *token)
{
    if (header->state != DS5_SCHED_SLOT_READY) {
        return false;
    }
    header->state = DS5_SCHED_SLOT_SENDING;
    *selected_header = *header;
    memcpy(selected_payload, payload, header->meta.length);
    token->storage_class = (uint8_t)store;
    token->slot = 0;
    token->version = header->version;
    return true;
}

bool esp32_dual_response_stage(uint8_t *frame,
                               size_t frame_capacity,
                               size_t *frame_len,
                               esp32_dual_response_token_t *token)
{
    response_header_t selected = {0};
    uint8_t payload[DS5_DUAL_SPI_MAX_PAYLOAD];
    bool valid = false;

    if (frame == NULL || token == NULL || frame_len == NULL) {
        return false;
    }
    memset(token, 0, sizeof(*token));
    *frame_len = 0;

    portENTER_CRITICAL(&s_response_mux);
#define SELECT_ARRAY(store, member, type_name)                                \
    select_array(store,                                                       \
                 &g_ds5_response_scheduler_storage.member[0].header,          \
                 sizeof(type_name),                                           \
                 sizeof(g_ds5_response_scheduler_storage.member) /            \
                     sizeof(g_ds5_response_scheduler_storage.member[0]),       \
                 (uint8_t *)g_ds5_response_scheduler_storage.member,           \
                 offsetof(type_name, payload),                                \
                 &selected, payload, token)

#define SELECT_CONTROL()                                                      \
    (SELECT_ARRAY(RESPONSE_STORE_CONTROL, control, response_control_slot_t) || \
     SELECT_ARRAY(RESPONSE_STORE_FEATURE, feature, response_feature_slot_t))
#define SELECT_LINK()                                                         \
    select_mailbox(RESPONSE_STORE_LINK,                                       \
                   &g_ds5_response_scheduler_storage.link.header,             \
                   g_ds5_response_scheduler_storage.link.payload,             \
                   &selected, payload, token)
#define SELECT_STATUS()                                                       \
    select_mailbox(RESPONSE_STORE_STATUS,                                     \
                   &g_ds5_response_scheduler_storage.status.header,           \
                   g_ds5_response_scheduler_storage.status.payload,           \
                   &selected, payload, token)
#define SELECT_TELEMETRY()                                                    \
    select_mailbox(RESPONSE_STORE_TELEMETRY,                                  \
                   &g_ds5_response_scheduler_storage.telemetry.header,        \
                   g_ds5_response_scheduler_storage.telemetry.payload,        \
                   &selected, payload, token)
#define SELECT_NONCONTROL_DEFAULT()                                           \
    (SELECT_ARRAY(RESPONSE_STORE_INPUT, input, response_input_slot_t) ||       \
     SELECT_ARRAY(RESPONSE_STORE_MIC, mic, response_mic_slot_t) ||            \
     SELECT_LINK() || SELECT_STATUS() || SELECT_TELEMETRY())

    if (s_control_burst < RESPONSE_CONTROL_MAX_BURST) {
        valid = SELECT_CONTROL();
    }
    if (!valid) {
        switch (s_noncontrol_cursor) {
        case 1U:
        case 5U:
            valid = SELECT_ARRAY(RESPONSE_STORE_MIC, mic,
                                 response_mic_slot_t);
            break;
        case 3U:
            valid = SELECT_LINK();
            break;
        case 6U:
            valid = SELECT_STATUS();
            break;
        case 8U:
            valid = SELECT_TELEMETRY();
            break;
        default:
            valid = SELECT_ARRAY(RESPONSE_STORE_INPUT, input,
                                 response_input_slot_t);
            break;
        }
        if (!valid) {
            valid = SELECT_NONCONTROL_DEFAULT();
        }
        if (valid) {
            s_noncontrol_cursor =
                (uint8_t)((s_noncontrol_cursor + 1U) % RESPONSE_NONCONTROL_SLOTS);
            s_control_burst = 0U;
        }
    }
    if (!valid) {
        valid = SELECT_CONTROL();
    }
    if (valid && (token->storage_class == RESPONSE_STORE_CONTROL ||
                  token->storage_class == RESPONSE_STORE_FEATURE)) {
        if (s_control_burst < RESPONSE_CONTROL_MAX_BURST) {
            s_control_burst++;
        }
    }
#undef SELECT_NONCONTROL_DEFAULT
#undef SELECT_TELEMETRY
#undef SELECT_STATUS
#undef SELECT_LINK
#undef SELECT_CONTROL
#undef SELECT_ARRAY
    sync_irq_locked();
    portEXIT_CRITICAL(&s_response_mux);

    if (!valid) {
        return false;
    }
    ds5_dual_spi_header_t header;
    ds5_dual_spi_header_init(&header,
                             selected.type,
                             selected.wire_flags,
                             selected.channel,
                             selected.priority,
                             selected.wire_sequence,
                             (uint32_t)selected.meta.created_us,
                             selected.meta.length);
    if (!ds5_dual_spi_finalize_frame(frame,
                                     frame_capacity,
                                     &header,
                                     payload)) {
        esp32_dual_response_finish(token, false);
        return false;
    }
    *frame_len = ds5_dual_spi_frame_len(selected.meta.length);
    return true;
}

static response_header_t *header_for_token(
    const esp32_dual_response_token_t *token)
{
    switch ((response_store_class_t)token->storage_class) {
    case RESPONSE_STORE_CONTROL:
        return token->slot < RESPONSE_CONTROL_CAPACITY ?
            &g_ds5_response_scheduler_storage.control[token->slot].header : NULL;
    case RESPONSE_STORE_FEATURE:
        return token->slot < RESPONSE_FEATURE_CAPACITY ?
            &g_ds5_response_scheduler_storage.feature[token->slot].header : NULL;
    case RESPONSE_STORE_INPUT:
        return token->slot < RESPONSE_INPUT_CAPACITY ?
            &g_ds5_response_scheduler_storage.input[token->slot].header : NULL;
    case RESPONSE_STORE_MIC:
        return token->slot < RESPONSE_MIC_CAPACITY ?
            &g_ds5_response_scheduler_storage.mic[token->slot].header : NULL;
    case RESPONSE_STORE_LINK:
        return &g_ds5_response_scheduler_storage.link.header;
    case RESPONSE_STORE_STATUS:
        return &g_ds5_response_scheduler_storage.status.header;
    case RESPONSE_STORE_TELEMETRY:
        return &g_ds5_response_scheduler_storage.telemetry.header;
    default:
        return NULL;
    }
}

void esp32_dual_response_finish(const esp32_dual_response_token_t *token,
                                bool success)
{
    if (token == NULL || token->storage_class == RESPONSE_STORE_NONE) {
        return;
    }
    portENTER_CRITICAL(&s_response_mux);
    response_header_t *header = header_for_token(token);
    if (header != NULL && header->version == token->version &&
        header->state == DS5_SCHED_SLOT_SENDING) {
        ds5_sched_class_metrics_t *metrics = metrics_for_store(
            (response_store_class_t)token->storage_class);
        if (success) {
            header->state = DS5_SCHED_SLOT_FREE;
            metrics->transmitted++;
            if (metrics->pending > 0U) {
                metrics->pending--;
            }
        } else {
            header->state = DS5_SCHED_SLOT_READY;
            metrics->transport_failed++;
        }
    }
    sync_irq_locked();
    portEXIT_CRITICAL(&s_response_mux);
}

uint8_t esp32_dual_response_pending_count(void)
{
    uint8_t pending;
    portENTER_CRITICAL(&s_response_mux);
    pending = pending_count_locked();
    portEXIT_CRITICAL(&s_response_mux);
    return pending;
}

void esp32_dual_response_get_metrics(ds5_sched_metrics_t *metrics)
{
    if (metrics == NULL) {
        return;
    }
    portENTER_CRITICAL(&s_response_mux);
    *metrics = g_ds5_response_scheduler_storage.metrics;
    portEXIT_CRITICAL(&s_response_mux);
}
